app/controllers/students_controller.rb

  def show
    new_student = Student.new(first_name: 'tyler', last_name: 'greason')
    @student = Student.find params[:id]
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]